In [73]:
import numpy as np
import pandas as pd

In [74]:
a = np.array([[1,2,3,4],[5,6,7,8]])

In [75]:
dict1 = {
    "name": ["Chinmay","DoIT","NeverGiveUP","ican"],
    "marks": [99, 98, 100, 1000],
    "city": ["dpr", "aura", "eathOn","mars"]
    
}

In [76]:
df = pd.DataFrame(dict1)

In [77]:
df

          name  marks    city
0      Chinmay     99     dpr
1         DoIT     98    aura
2  NeverGiveUP    100  eathOn
3         ican   1000    mars

In [78]:
df.to_csv('friends.csv')

In [116]:
df.to_csv('friends_index_false.csv', index=False)

In [117]:
df.head(2)

      name  marks  city
0  Chinmay     99   dpr
1     DoIT     98  aura

In [81]:
df.tail(2)

          name  marks    city
2  NeverGiveUP    100  eathOn
3         ican   1000    mars

In [82]:
df.describe()

            marks
count     4.00000
mean    324.25000
std     450.50074
min      98.00000
25%      98.75000
50%      99.50000
75%     325.00000
max    1000.00000

In [83]:
 df.to_csv('chinmay.csv')

In [84]:
cb = pd.read_csv('chinmay.csv')

In [85]:
cb

   Unnamed: 0         name  marks    city
0           0      Chinmay     99     dpr
1           1         DoIT     98    aura
2           2  NeverGiveUP    100  eathOn
3           3         ican   1000    mars

In [86]:
# cb['speed'][0] = 50

In [87]:
cb

   Unnamed: 0         name  marks    city
0           0      Chinmay     99     dpr
1           1         DoIT     98    aura
2           2  NeverGiveUP    100  eathOn
3           3         ican   1000    mars

In [88]:
cb.to_csv('chinmay.csv')

In [89]:
cb.index = ['first','second','third','fourth']

In [90]:
cb

        Unnamed: 0         name  marks    city
first            0      Chinmay     99     dpr
second           1         DoIT     98    aura
third            2  NeverGiveUP    100  eathOn
fourth           3         ican   1000    mars

In [93]:
 ser = pd.Series(np.random.rand(34))

In [94]:
ser

0     0.855265
1     0.929224
2     0.211374
3     0.042804
4     0.164893
5     0.182232
6     0.331393
7     0.095191
8     0.013233
9     0.713348
10    0.276348
11    0.106650
12    0.104120
13    0.806257
14    0.646004
15    0.270815
16    0.554747
17    0.294234
18    0.704129
19    0.394827
20    0.029879
21    0.382176
22    0.005794
23    0.028881
24    0.939027
25    0.711278
26    0.744004
27    0.752887
28    0.735831
29    0.282211
30    0.940340
31    0.071409
32    0.240362
33    0.916352
dtype: float64

In [95]:
type(ser)

pandas.core.series.Series

In [96]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [97]:
newdf

            0         1         2         3         4
0    0.301146  0.815837  0.118865  0.115897  0.701587
1    0.261830  0.018374  0.023429  0.992384  0.784962
2    0.177497  0.505714  0.440075  0.940590  0.521198
3    0.733431  0.185460  0.219865  0.502103  0.891877
4    0.366923  0.887062  0.228775  0.227142  0.490151
..        ...       ...       ...       ...       ...
329  0.902414  0.195703  0.703550  0.703323  0.272135
330  0.185665  0.389205  0.538308  0.405219  0.828932
331  0.141820  0.378597  0.446374  0.024121  0.534928
332  0.550884  0.533615  0.003414  0.262225  0.646644
333  0.822331  0.077834  0.956624  0.576070  0.523286

[334 rows x 5 columns]

In [103]:
type(newdf)
df.head()

          name  marks    city
0      Chinmay     99     dpr
1         DoIT     98    aura
2  NeverGiveUP    100  eathOn
3         ican   1000    mars

In [99]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.502469    0.511372    0.500558    0.508403    0.456357
std      0.279248    0.294326    0.278705    0.279922    0.283174
min      0.002382    0.001308    0.003414    0.005570    0.002270
25%      0.277944    0.246142    0.264399    0.285860    0.211831
50%      0.494657    0.529489    0.504862    0.515773    0.451666
75%      0.743146    0.758908    0.737397    0.745690    0.672403
max      0.998168    0.999877    0.998803    0.994989    0.996332

In [102]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [104]:
newdf[0][0] = "Chinmay"

In [105]:
newdf.head()

          0         1         2         3         4
0   Chinmay  0.815837  0.118865  0.115897  0.701587
1   0.26183  0.018374  0.023429  0.992384  0.784962
2  0.177497  0.505714  0.440075  0.940590  0.521198
3  0.733431  0.185460  0.219865  0.502103  0.891877
4  0.366923  0.887062  0.228775  0.227142  0.490151

In [106]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [107]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [111]:
newdf.to_numpy()

array([[0.3, 0.8158367152587626, 0.11886528406935037,
        0.11589674629375868, 0.7015865300436215],
       [0.2618301099592141, 0.018373918045767823, 0.023429015384120122,
        0.992384326862256, 0.7849616806597369],
       [0.17749734755873703, 0.5057143498373993, 0.44007542763061,
        0.9405899095442091, 0.5211975664586238],
       ...,
       [0.14182035298887452, 0.37859708196867037, 0.44637392329056225,
        0.024120651922481362, 0.5349282225328883],
       [0.5508844388427924, 0.5336152454474786, 0.00341445214078806,
        0.26222505730285695, 0.6466435336140729],
       [0.8223307993607709, 0.07783413052781718, 0.9566244131370205,
        0.5760700662702801, 0.5232862562029971]], dtype=object)

In [109]:
newdf[0][0] = 0.3

In [110]:
newdf.head()

          0         1         2         3         4
0       0.3  0.815837  0.118865  0.115897  0.701587
1   0.26183  0.018374  0.023429  0.992384  0.784962
2  0.177497  0.505714  0.440075  0.940590  0.521198
3  0.733431  0.185460  0.219865  0.502103  0.891877
4  0.366923  0.887062  0.228775  0.227142  0.490151

In [114]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.26183,0.177497,0.733431,0.366923,0.644156,0.498336,0.136431,0.169136,0.178504,...,0.09309,0.894446,0.183939,0.11738,0.144262,0.902414,0.185665,0.14182,0.550884,0.822331
1,0.815837,0.018374,0.505714,0.18546,0.887062,0.278051,0.654526,0.234324,0.865769,0.896469,...,0.852979,0.42859,0.48855,0.594556,0.869181,0.195703,0.389205,0.378597,0.533615,0.077834
2,0.118865,0.023429,0.440075,0.219865,0.228775,0.554233,0.864403,0.041372,0.954626,0.609747,...,0.705856,0.900201,0.704319,0.435905,0.54519,0.70355,0.538308,0.446374,0.003414,0.956624
3,0.115897,0.992384,0.94059,0.502103,0.227142,0.479623,0.070948,0.023123,0.819223,0.725636,...,0.237134,0.18149,0.668919,0.607284,0.321811,0.703323,0.405219,0.024121,0.262225,0.57607
4,0.701587,0.784962,0.521198,0.891877,0.490151,0.209379,0.438729,0.996332,0.502198,0.098904,...,0.800123,0.430535,0.519497,0.054896,0.12069,0.272135,0.828932,0.534928,0.646644,0.523286

In [118]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.701587  0.115897  0.118865  0.815837       0.3
1    0.784962  0.992384  0.023429  0.018374   0.26183
2    0.521198  0.940590  0.440075  0.505714  0.177497
3    0.891877  0.502103  0.219865  0.185460  0.733431
4    0.490151  0.227142  0.228775  0.887062  0.366923
..        ...       ...       ...       ...       ...
329  0.272135  0.703323  0.703550  0.195703  0.902414
330  0.828932  0.405219  0.538308  0.389205  0.185665
331  0.534928  0.024121  0.446374  0.378597   0.14182
332  0.646644  0.262225  0.003414  0.533615  0.550884
333  0.523286  0.576070  0.956624  0.077834  0.822331

[334 rows x 5 columns]

In [120]:
type(newdf[0])

pandas.core.series.Series